Makr91/zoneweaver/packaging/omnios/man/zoneweaver.8
.Dd $Mdocdate$
.Dt ZONEWEAVER 8
.Os
.Sh NAME
.Nm zoneweaver
.Nd zone hypervisor management frontend web interface
.Sh SYNOPSIS
.Nm
.Op Fl -help
.Op Fl -version
.Sh DESCRIPTION
The
.Nm
utility provides a web-based frontend interface for managing Bhyve virtual
machines and zones through WebHyve backend servers. It serves as the user-facing
component of the ZoneWeaver zone hypervisor management platform.
.Pp
.Nm
is a Node.js Express application serving a React-based web interface that 
provides comprehensive user and organization management capabilities including:
.Bl -bullet -offset indent
.It
User authentication and session management with JWT tokens
.It
Multi-tenant organization management and access control
.It
WebHyve backend server configuration and connection management
.It
Web-based dashboard for zone management operations
.It
User invitation and registration system with email notifications
.It
Role-based access control (Super Admin, Admin, User)
.It
SSL/TLS encryption with automatic certificate generation
.El
.Pp
The service uses JWT token authentication for web sessions and connects to
WebHyve backend servers for actual zone management operations.
.Sh CONFIGURATION
.Nm
reads its configuration from
.Pa /etc/zoneweaver/config.yaml
by default. The configuration file uses YAML format and controls all aspects
of the service including network ports, SSL settings, database configuration,
user authentication, and organization management parameters.
.Pp
See
.Xr zoneweaver.yaml 5
for detailed configuration file format documentation.
.Sh SERVICE MANAGEMENT
The
.Nm
service is managed through the Service Management Facility (SMF). Use the
following commands to control the service:
.Pp
.Dl # svcadm enable zoneweaver
.Dl # svcadm disable zoneweaver
.Dl # svcadm restart zoneweaver
.Pp
Check service status:
.Pp
.Dl # svcs zoneweaver
.Sh WEB INTERFACE
The service provides a modern React-based web interface accessible through
a standard web browser. The default access URL is:
.Pp
.Dl https://localhost:3443
.Pp
Key web interface features include:
.Bl -bullet -offset indent
.It
User login and registration with organization management
.It
Dashboard with zone overview from connected WebHyve servers
.It
Server configuration and connection management
.It
User and organization administration
.It
Settings and configuration management
.It
Zone management operations through connected backends
.El
.Sh API ENDPOINTS
The service provides REST API endpoints for user and organization management.
Interactive API documentation is available at:
.Pp
.Dl https://localhost:3443/api-docs
.Pp
Key API endpoint categories include:
.Bl -tag -width ".Pa /api/organizations"
.It Pa /api/auth
User authentication and session management
.It Pa /api/users
User profile and account management
.It Pa /api/organizations
Organization creation and management
.It Pa /api/servers
WebHyve backend server configuration
.It Pa /api/invitations
User invitation and registration codes
.It Pa /api/settings
Application settings and preferences
.El
.Sh AUTHENTICATION
Web access uses JWT token-based authentication. Users must register and login
through the web interface. Initial organization setup (if enabled in config):
.Pp
.Dl Navigate to https://localhost:3443/register
.Pp
For existing organizations, users need an invitation code from an administrator.
The first user in a new organization automatically becomes the admin.
.Sh FILES
.Bl -tag -width ".Pa /var/lib/zoneweaver/database/"
.It Pa /etc/zoneweaver/config.yaml
Main configuration file
.It Pa /etc/zoneweaver/ssl/
SSL certificate directory (auto-generated if enabled)
.It Pa /var/lib/zoneweaver/database/
SQLite database directory for user and organization data
.It Pa /var/log/zoneweaver/
Service log directory
.It Pa /opt/zoneweaver/
Installation directory
.El
.Sh EXIT STATUS
.Ex -std
.Sh EXAMPLES
Start the service manually for testing:
.Bd -literal -offset indent
# cd /opt/zoneweaver
# node index.js
.Ed
.Pp
Check web interface connectivity:
.Bd -literal -offset indent
# curl -k https://localhost:3443/
.Ed
.Pp
Test API endpoint:
.Bd -literal -offset indent
# curl -k https://localhost:3443/api/health
.Ed
.Sh DIAGNOSTICS
The service logs operational information to standard output when run manually,
or to SMF service logs when running under SMF management.
.Pp
Common diagnostic steps:
.Bl -enum -offset indent
.It
Check SMF service status: 
.Cm svcs -xv zoneweaver
.It
Review service logs: 
.Cm svcs -L zoneweaver
.It
Verify configuration syntax: 
.Cm node -c /opt/zoneweaver/index.js
.It
Test network connectivity to port 3443
.It
Verify database permissions and disk space
.It
Check WebHyve backend server connectivity from web interface
.El
.Sh SEE ALSO
.Xr zoneweaver.yaml 5 ,
.Xr zoneweaver-api 8 ,
.Xr svcadm 8 ,
.Xr svcs 1
.Sh STANDARDS
The frontend API follows REST architectural principles and returns JSON-formatted
responses. Authentication uses industry-standard JWT token mechanisms with
bcrypt hashing for secure password storage.
.Sh HISTORY
.Nm
first appeared in ZoneWeaver 0.0.1 as part of the OmniOS zone hypervisor
.\" x-release-please-version
management platform.
.Sh AUTHORS
.An ZoneWeaver Project
.Sh SECURITY
.Nm
implements several security measures:
.Bl -bullet -offset indent
.It
JWT token authentication with configurable expiration timeouts
.It
Bcrypt password hashing for secure user credential storage
.It
SSL/TLS encryption with automatic certificate generation
.It
Multi-tenant organization isolation and access control
.It
Role-based permissions (Super Admin, Admin, User)
.It
CORS validation for web browser security
.It
Session management with automatic timeout and cleanup
.El
.Pp
For production deployments, ensure:
.Bl -bullet -offset indent
.It
Strong JWT secret is configured and kept secure
.It
SSL certificates are properly configured or auto-generation is enabled
.It
Organization creation is disabled after initial setup
.It
User invitation system is properly configured with email validation
.It
Network access is appropriately restricted via firewall rules
.It
Database files have proper filesystem permissions
.It
Regular security updates and monitoring of user access patterns
.El
